# encoding: utf-8
Feature: Listing tasks
 As a time-manager
  In order to browse my tasks
  I want to view list of my tasks

  Background:
    Given following tasks exists:
      | title               | description  | created_at | 
      | Тестовая задача 1   | Описание     | 1415812561 |
      | Тестовая задача 2   | Описание     | 1415812566 |
      | Тестовая задача 3   | Описание     | 1415812571 |
      | Тестовая задача 4   | Описание     | 1415812576 |
      | Тестовая задача 5   | Описание     | 1415812581 |
      | Тестовая задача 6   | Описание     | 1415812586 |
      | Тестовая задача 7   | Описание     | 1415812591 |
      | Тестовая задача 8   | Описание     | 1415812596 |
      | Тестовая задача 9   | Описание     | 1415812601 |
      | Тестовая задача 10  | Описание     | 1415812606 |
      | Тестовая задача 11  | Описание     | 1415812611 |
      | Тестовая задача 12  | Описание     | 1415812616 |
      | Тестовая задача 13  | Описание     | 1415812621 |

  Scenario: list 10 last tasks
    When I run command `list`
    Then I should see
    """
    #13     Тестовая задача 13                       2014-11-12
    #12     Тестовая задача 12                       2014-11-12
    #11     Тестовая задача 11                       2014-11-12
    #10     Тестовая задача 10                       2014-11-12
    #9      Тестовая задача 9                        2014-11-12
    #8      Тестовая задача 8                        2014-11-12
    #7      Тестовая задача 7                        2014-11-12
    #6      Тестовая задача 6                        2014-11-12
    #5      Тестовая задача 5                        2014-11-12
    #4      Тестовая задача 4                        2014-11-12
    """

  Scenario: list all tasks
    When I run command `list -a`
    Then I should see
      """
      #13     Тестовая задача 13                       2014-11-12
      #12     Тестовая задача 12                       2014-11-12
      #11     Тестовая задача 11                       2014-11-12
      #10     Тестовая задача 10                       2014-11-12
      #9      Тестовая задача 9                        2014-11-12
      #8      Тестовая задача 8                        2014-11-12
      #7      Тестовая задача 7                        2014-11-12
      #6      Тестовая задача 6                        2014-11-12
      #5      Тестовая задача 5                        2014-11-12
      #4      Тестовая задача 4                        2014-11-12
      #3      Тестовая задача 3                        2014-11-12
      #2      Тестовая задача 2                        2014-11-12
      #1      Тестовая задача 1                        2014-11-12
      """